In [1]:
import numpy as np 
import pandas as pd

In [18]:
df = pd.read_csv('cars.csv')

In [53]:
df.sample(5)

         brand  km_driven    fuel                 owner  selling_price
7113    Maruti     120000  Diesel          Second Owner         200000
6212    Maruti       9000  Diesel           First Owner         890000
6234  Mahindra      80000  Diesel           First Owner         499000
4741  Mahindra     117000  Diesel           First Owner         800000
5060    Toyota     250000  Diesel  Fourth & Above Owner         100000

In [6]:
# df['brand'].value_counts()
df['brand'].nunique()  # 32 Brands

32

In [7]:
df['fuel'].value_counts()

fuel
Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: count, dtype: int64

# One Hot Encoding using Pandas

In [13]:
pd.get_dummies(df, columns= ['fuel','owner'], drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,True,False,False,False,False,False,False
1,Skoda,120000,370000,True,False,False,False,True,False,False
2,Honda,140000,158000,False,False,True,False,False,False,True
3,Hyundai,127000,225000,True,False,False,False,False,False,False
4,Maruti,120000,130000,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,False,False,True,False,False,False,False
8124,Hyundai,119000,135000,True,False,False,True,False,False,False
8125,Maruti,120000,382000,True,False,False,False,False,False,False
8126,Tata,25000,290000,True,False,False,False,False,False,False
8127,Tata,25000,290000,True,False,False,False,False,False,False

# One Hot Enoding using Sklearn

In [20]:
from sklearn.model_selection import train_test_split

In [23]:
X = df.drop('selling_price',axis=1)
y = df['selling_price']

In [35]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.20,random_state=42)

In [36]:
from sklearn.preprocessing import OneHotEncoder

In [37]:
ohe = OneHotEncoder(drop='first',sparse_output=False,dtype=int)

In [38]:
X_train_encoded = ohe.fit_transform(X_train[['fuel','owner']])

In [39]:
X_train_encoded

array([[0, 0, 1, ..., 0, 0, 0],
       [0, 0, 1, ..., 1, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       ...,
       [0, 0, 1, ..., 0, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       [0, 0, 1, ..., 1, 0, 0]], shape=(6502, 7))

In [40]:
X_test_encoded = ohe.fit_transform(X_test[['fuel','owner']])

In [41]:
X_test_encoded

array([[0, 0, 1, ..., 0, 0, 1],
       [1, 0, 0, ..., 0, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       ...,
       [0, 0, 1, ..., 0, 0, 0],
       [0, 0, 1, ..., 0, 0, 0],
       [0, 0, 1, ..., 1, 0, 0]], shape=(1626, 7))

In [49]:
new = np.hstack((X_train[['brand','km_driven']].values,X_train_encoded))

In [54]:
df_encoded = pd.DataFrame(new, columns=['Brand','km_driven','fuel_diesel','fuel_CNG','fuel_LPG','Second_Owner','Third_Owner','Fourth_and_above_Owner','Test_Drive_Owner'])

In [55]:
df_encoded.head()

,Brand,km_driven,fuel_diesel,fuel_CNG,fuel_LPG,Second_Owner,Third_Owner,Fourth_and_above_Owner,Test_Drive_Owner
0,Tata,2560,0,0,1,0,0,0,0
1,Honda,80000,0,0,1,0,1,0,0
2,Hyundai,150000,1,0,0,1,0,0,0
3,Maruti,120000,1,0,0,0,1,0,0
4,Maruti,25000,0,0,1,0,0,0,0

# One Hot Encoding of Brand Column in DataFrame

In [56]:
count = df['brand'].value_counts()

In [64]:
repl = count[count<=100].index

In [65]:
repl

Index(['Nissan', 'Jaguar', 'Volvo', 'Datsun', 'Mercedes-Benz', 'Fiat', 'Audi',
       'Lexus', 'Jeep', 'Mitsubishi', 'Land', 'Force', 'Isuzu', 'Ambassador',
       'Kia', 'MG', 'Daewoo', 'Ashok', 'Opel', 'Peugeot'],
      dtype='object', name='brand')

In [69]:
brands = pd.get_dummies(df['brand'].replace(repl,'UnCommon')).astype(int)

In [70]:
brands.head(5)

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,UnCommon,Volkswagen
0,0,0,0,0,0,0,1,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,1,0,0,0,0
2,0,0,0,1,0,0,0,0,0,0,0,0,0
3,0,0,0,0,1,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,1,0,0,0,0,0,0